app/Models/DataBarang_Model.php

    public function fetch_data()
    {
        return $this->findAll();
---
SELECT *
FROM `barang`