app/Models/OverheadModel.php

    public function fetch_data()
    {
        return $this->findAll();
---
SELECT *
FROM `overhead`