app/Models/PembelianBarangModel.php

    public function fetch_data()
    {
        return $this->findAll();
---
SELECT *
FROM `pembelian_barang`